InformationRegisters/ОчередьОбработкиВходящихДокументовМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбработкиВходящихДокументовМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСубъектаОбращения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизацииОтправителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квитанция</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьОбработкиВходящихДокументовМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтруктураДанныхСообщения() Экспорт
	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(), ПустойКлюч().Метаданные());
	
КонецФункции

Процедура ДобавитьСообщениеВОчередь(ДанныеСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХешСумма = ИнтеграцияМДЛП.ХешСуммаСтрокой(ДанныеСообщения.Данные);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Очередь.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ОчередьОбработкиВходящихДокументовМДЛП КАК Очередь
	|ГДЕ
	|	Очередь.ИдентификаторЗапроса = &ИдентификаторЗапроса
	|	И Очередь.ХешСумма = &ХешСумма
	|");
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", ДанныеСообщения.ИдентификаторЗапроса);
	Запрос.УстановитьПараметр("ХешСумма", ХешСумма);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Данные.Получить() = ДанныеСообщения.Данные Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Запись = РегистрыСведений.ОчередьОбработкиВходящихДокументовМДЛП.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ДанныеСообщения);
	Запись.ИдентификаторСообщения = Новый УникальныйИдентификатор;
	Запись.Данные = Новый ХранилищеЗначения(ДанныеСообщения.Данные, Новый СжатиеДанных(9));
	Если ТипЗнч(ДанныеСообщения.Квитанция) = Тип("Строка") И ЗначениеЗаполнено(ДанныеСообщения.Квитанция) Тогда
		Запись.Квитанция = Новый ХранилищеЗначения(ДанныеСообщения.Квитанция, Новый СжатиеДанных(9));
	КонецЕсли;
	Запись.ДатаРегистрации = ТекущаяДатаСеанса();
	Запись.ХешСумма = ХешСумма;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьСообщениеИзОчереди(ИдентификаторСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.ОчередьОбработкиВходящихДокументовМДЛП.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
